apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emios.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_emios.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_EMIOS_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_EMIOS_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* eMIOS Register Offsets ***************************************************/

#define S32K3XX_EMIOS_MCR_OFFSET     (0x0000) /* Module Configuration Register (MCR) */
#define S32K3XX_EMIOS_GFLAG_OFFSET   (0x0004) /* Global Flag Register (GFLAG) */
#define S32K3XX_EMIOS_OUDIS_OFFSET   (0x0008) /* Output Update Disable Register (OUDIS) */
#define S32K3XX_EMIOS_UCDIS_OFFSET   (0x000c) /* Disable Channel Register (UCDIS) */

#define S32K3XX_EMIOS_A_OFFSET(n)    ((n) * 0x0020 + 0x0020) /* UC A n (An) */
#define S32K3XX_EMIOS_B_OFFSET(n)    ((n) * 0x0020 + 0x0024) /* UC B n (Bn) */
#define S32K3XX_EMIOS_CNT_OFFSET(n)  ((n) * 0x0020 + 0x0028) /* UC Counter n (CNTn) */
#define S32K3XX_EMIOS_C_OFFSET(n)    ((n) * 0x0020 + 0x002c) /* UC Control n (Cn) */
#define S32K3XX_EMIOS_S_OFFSET(n)    ((n) * 0x0020 + 0x0030) /* UC Status n (Sn) */
#define S32K3XX_EMIOS_ALTA_OFFSET(n) ((n) * 0x0020 + 0x0034) /* Alternate Address n (ALTAn) */
#define S32K3XX_EMIOS_C2_OFFSET(n)   ((n) * 0x0020 + 0x0038) /* UC Control 2 n (C2_n) */

/* eMIOS Register Addresses *************************************************/

#define S32K3XX_EMIOS0_MCR           (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_MCR_OFFSET)
#define S32K3XX_EMIOS0_GFLAG         (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_GFLAG_OFFSET)
#define S32K3XX_EMIOS0_OUDIS         (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_OUDIS_OFFSET)
#define S32K3XX_EMIOS0_UCDIS         (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_UCDIS_OFFSET)
#define S32K3XX_EMIOS0_A(n)          (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_A_OFFSET(n))
#define S32K3XX_EMIOS0_B(n)          (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_B_OFFSET(n))
#define S32K3XX_EMIOS0_CNT(n)        (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_CNT_OFFSET(n))
#define S32K3XX_EMIOS0_C(n)          (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_C_OFFSET(n))
#define S32K3XX_EMIOS0_S(n)          (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_S_OFFSET(n))
#define S32K3XX_EMIOS0_ALTA(n)       (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_ALTA_OFFSET(n))
#define S32K3XX_EMIOS0_C2(n)         (S32K3XX_EMIOS0_BASE + S32K3XX_EMIOS_C2_OFFSET(n))

#define S32K3XX_EMIOS1_MCR           (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_MCR_OFFSET)
#define S32K3XX_EMIOS1_GFLAG         (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_GFLAG_OFFSET)
#define S32K3XX_EMIOS1_OUDIS         (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_OUDIS_OFFSET)
#define S32K3XX_EMIOS1_UCDIS         (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_UCDIS_OFFSET)
#define S32K3XX_EMIOS1_A(n)          (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_A_OFFSET(n))
#define S32K3XX_EMIOS1_B(n)          (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_B_OFFSET(n))
#define S32K3XX_EMIOS1_CNT(n)        (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_CNT_OFFSET(n))
#define S32K3XX_EMIOS1_C(n)          (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_C_OFFSET(n))
#define S32K3XX_EMIOS1_S(n)          (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_S_OFFSET(n))
#define S32K3XX_EMIOS1_ALTA(n)       (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_ALTA_OFFSET(n))
#define S32K3XX_EMIOS1_C2(n)         (S32K3XX_EMIOS1_BASE + S32K3XX_EMIOS_C2_OFFSET(n))

#define S32K3XX_EMIOS2_MCR           (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_MCR_OFFSET)
#define S32K3XX_EMIOS2_GFLAG         (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_GFLAG_OFFSET)
#define S32K3XX_EMIOS2_OUDIS         (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_OUDIS_OFFSET)
#define S32K3XX_EMIOS2_UCDIS         (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_UCDIS_OFFSET)
#define S32K3XX_EMIOS2_A(n)          (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_A_OFFSET(n))
#define S32K3XX_EMIOS2_B(n)          (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_B_OFFSET(n))
#define S32K3XX_EMIOS2_CNT(n)        (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_CNT_OFFSET(n))
#define S32K3XX_EMIOS2_C(n)          (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_C_OFFSET(n))
#define S32K3XX_EMIOS2_S(n)          (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_S_OFFSET(n))
#define S32K3XX_EMIOS2_ALTA(n)       (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_ALTA_OFFSET(n))
#define S32K3XX_EMIOS2_C2(n)         (S32K3XX_EMIOS2_BASE + S32K3XX_EMIOS_C2_OFFSET(n))

/* eMIOS Register Bitfield Definitions **************************************/

/* Module Configuration Register (MCR) */

                                               /* Bits 0-7: Reserved */
#define EMIOS_MCR_GPRE_SHIFT         (8)       /* Bits 8-15: Global Prescaler (GPRE) */
#define EMIOS_MCR_GPRE_MASK          (0xff << EMIOS_MCR_GPRE_SHIFT)
#define EMIOS_MCR_GPRE(n)            (((n) << EMIOS_MCR_GPRE_SHIFT) & EMIOS_MCR_GPRE_MASK)
                                               /* Bits 16-25: Reserved */
#define EMIOS_MCR_GPREN              (1 << 26) /* Bit 26: Global Prescaler Enable (GPREN) */
                                               /* Bit 27: Reserved */
#define EMIOS_MCR_GTBE               (1 << 28) /* Bit 28: Global Timebase Enable (GTBE) */
#define EMIOS_MCR_FRZ                (1 << 29) /* Bit 29: Freeze (FRZ) */
#define EMIOS_MCR_MDIS               (1 << 30) /* Bit 30: Module Disable (MDIS) */
                                               /* Bit 31: Reserved */

/* Global Flag Register (GFLAG) */

