apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emios.h
#define EMIOS_GFLAG_F0               (1 << 0)  /* Bit 0: Mirror of UC 0 FLAG (F0) */
#define EMIOS_GFLAG_F1               (1 << 1)  /* Bit 1: Mirror of UC 1 FLAG (F1) */
#define EMIOS_GFLAG_F2               (1 << 2)  /* Bit 2: Mirror of UC 2 FLAG (F2) */
#define EMIOS_GFLAG_F3               (1 << 3)  /* Bit 3: Mirror of UC 3 FLAG (F3) */
#define EMIOS_GFLAG_F4               (1 << 4)  /* Bit 4: Mirror of UC 4 FLAG (F4) */
#define EMIOS_GFLAG_F5               (1 << 5)  /* Bit 5: Mirror of UC 5 FLAG (F5) */
#define EMIOS_GFLAG_F6               (1 << 6)  /* Bit 6: Mirror of UC 6 FLAG (F6) */
#define EMIOS_GFLAG_F7               (1 << 7)  /* Bit 7: Mirror of UC 7 FLAG (F7) */
#define EMIOS_GFLAG_F8               (1 << 8)  /* Bit 8: Mirror of UC 8 FLAG (F8) */
#define EMIOS_GFLAG_F9               (1 << 9)  /* Bit 9: Mirror of UC 9 FLAG (F9) */
#define EMIOS_GFLAG_F10              (1 << 10) /* Bit 10: Mirror of UC 10 FLAG (F10) */
#define EMIOS_GFLAG_F11              (1 << 11) /* Bit 11: Mirror of UC 11 FLAG (F11) */
#define EMIOS_GFLAG_F12              (1 << 12) /* Bit 12: Mirror of UC 12 FLAG (F12) */
#define EMIOS_GFLAG_F13              (1 << 13) /* Bit 13: Mirror of UC 13 FLAG (F13) */
#define EMIOS_GFLAG_F14              (1 << 14) /* Bit 14: Mirror of UC 14 FLAG (F14) */
#define EMIOS_GFLAG_F15              (1 << 15) /* Bit 15: Mirror of UC 15 FLAG (F15) */
#define EMIOS_GFLAG_F16              (1 << 16) /* Bit 16: Mirror of UC 16 FLAG (F16) */
#define EMIOS_GFLAG_F17              (1 << 17) /* Bit 17: Mirror of UC 17 FLAG (F17) */
#define EMIOS_GFLAG_F18              (1 << 18) /* Bit 18: Mirror of UC 18 FLAG (F18) */
#define EMIOS_GFLAG_F19              (1 << 19) /* Bit 19: Mirror of UC 19 FLAG (F19) */
#define EMIOS_GFLAG_F20              (1 << 20) /* Bit 20: Mirror of UC 20 FLAG (F20) */
#define EMIOS_GFLAG_F21              (1 << 21) /* Bit 21: Mirror of UC 21 FLAG (F21) */
#define EMIOS_GFLAG_F22              (1 << 22) /* Bit 22: Mirror of UC 22 FLAG (F22) */
#define EMIOS_GFLAG_F23              (1 << 23) /* Bit 23: Mirror of UC 23 FLAG (F23) */
                                               /* Bits 24-31: Reserved */

/* Output Update Disable Register (OUDIS) */

#define EMIOS_OUDIS_OU0              (1 << 0)  /* Bit 0: Channel 0 Output Update Disable (OU0) */
#define EMIOS_OUDIS_OU1              (1 << 1)  /* Bit 1: Channel 1 Output Update Disable (OU1) */
#define EMIOS_OUDIS_OU2              (1 << 2)  /* Bit 2: Channel 2 Output Update Disable (OU2) */
#define EMIOS_OUDIS_OU3              (1 << 3)  /* Bit 3: Channel 3 Output Update Disable (OU3) */
#define EMIOS_OUDIS_OU4              (1 << 4)  /* Bit 4: Channel 4 Output Update Disable (OU4) */
#define EMIOS_OUDIS_OU5              (1 << 5)  /* Bit 5: Channel 5 Output Update Disable (OU5) */
#define EMIOS_OUDIS_OU6              (1 << 6)  /* Bit 6: Channel 6 Output Update Disable (OU6) */
#define EMIOS_OUDIS_OU7              (1 << 7)  /* Bit 7: Channel 7 Output Update Disable (OU7) */
#define EMIOS_OUDIS_OU8              (1 << 8)  /* Bit 8: Channel 8 Output Update Disable (OU8) */
#define EMIOS_OUDIS_OU9              (1 << 9)  /* Bit 9: Channel 9 Output Update Disable (OU9) */
#define EMIOS_OUDIS_OU10             (1 << 10) /* Bit 10: Channel 10 Output Update Disable (OU10) */
#define EMIOS_OUDIS_OU11             (1 << 11) /* Bit 11: Channel 11 Output Update Disable (OU11) */
#define EMIOS_OUDIS_OU12             (1 << 12) /* Bit 12: Channel 12 Output Update Disable (OU12) */
#define EMIOS_OUDIS_OU13             (1 << 13) /* Bit 13: Channel 13 Output Update Disable (OU13) */
#define EMIOS_OUDIS_OU14             (1 << 14) /* Bit 14: Channel 14 Output Update Disable (OU14) */
#define EMIOS_OUDIS_OU15             (1 << 15) /* Bit 15: Channel 15 Output Update Disable (OU15) */
#define EMIOS_OUDIS_OU16             (1 << 16) /* Bit 16: Channel 16 Output Update Disable (OU16) */
#define EMIOS_OUDIS_OU17             (1 << 17) /* Bit 17: Channel 17 Output Update Disable (OU17) */
#define EMIOS_OUDIS_OU18             (1 << 18) /* Bit 18: Channel 18 Output Update Disable (OU18) */
#define EMIOS_OUDIS_OU19             (1 << 19) /* Bit 19: Channel 19 Output Update Disable (OU19) */
#define EMIOS_OUDIS_OU20             (1 << 20) /* Bit 20: Channel 20 Output Update Disable (OU20) */
#define EMIOS_OUDIS_OU21             (1 << 21) /* Bit 21: Channel 21 Output Update Disable (OU21) */
#define EMIOS_OUDIS_OU22             (1 << 22) /* Bit 22: Channel 22 Output Update Disable (OU22) */
#define EMIOS_OUDIS_OU23             (1 << 23) /* Bit 23: Channel 23 Output Update Disable (OU23) */
#define EMIOS_OUDIS_OU(n)            (1 << n)  /* Bit n: Channel n Output Update Disable (OU23) */
                                               /* Bits 24-31: Reserved */

/* Disable Channel Register (UCDIS) */

#define EMIOS_UCDIS_OU0              (1 << 0)  /* Bit 0: Disable UC 0 (UCDIS0) */
#define EMIOS_UCDIS_OU1              (1 << 1)  /* Bit 1: Disable UC 1 (UCDIS1) */
#define EMIOS_UCDIS_OU2              (1 << 2)  /* Bit 2: Disable UC 2 (UCDIS2) */
#define EMIOS_UCDIS_OU3              (1 << 3)  /* Bit 3: Disable UC 3 (UCDIS3) */
#define EMIOS_UCDIS_OU4              (1 << 4)  /* Bit 4: Disable UC 4 (UCDIS4) */
#define EMIOS_UCDIS_OU5              (1 << 5)  /* Bit 5: Disable UC 5 (UCDIS5) */
#define EMIOS_UCDIS_OU6              (1 << 6)  /* Bit 6: Disable UC 6 (UCDIS6) */
#define EMIOS_UCDIS_OU7              (1 << 7)  /* Bit 7: Disable UC 7 (UCDIS7) */
#define EMIOS_UCDIS_OU8              (1 << 8)  /* Bit 8: Disable UC 8 (UCDIS8) */
#define EMIOS_UCDIS_OU9              (1 << 9)  /* Bit 9: Disable UC 9 (UCDIS9) */
#define EMIOS_UCDIS_OU10             (1 << 10) /* Bit 10: Disable UC 10 (UCDIS10) */
#define EMIOS_UCDIS_OU11             (1 << 11) /* Bit 11: Disable UC 11 (UCDIS11) */
#define EMIOS_UCDIS_OU12             (1 << 12) /* Bit 12: Disable UC 12 (UCDIS12) */
#define EMIOS_UCDIS_OU13             (1 << 13) /* Bit 13: Disable UC 13 (UCDIS13) */
#define EMIOS_UCDIS_OU14             (1 << 14) /* Bit 14: Disable UC 14 (UCDIS14) */
#define EMIOS_UCDIS_OU15             (1 << 15) /* Bit 15: Disable UC 15 (UCDIS15) */
#define EMIOS_UCDIS_OU16             (1 << 16) /* Bit 16: Disable UC 16 (UCDIS16) */
#define EMIOS_UCDIS_OU17             (1 << 17) /* Bit 17: Disable UC 17 (UCDIS17) */
#define EMIOS_UCDIS_OU18             (1 << 18) /* Bit 18: Disable UC 18 (UCDIS18) */
#define EMIOS_UCDIS_OU19             (1 << 19) /* Bit 19: Disable UC 19 (UCDIS19) */
#define EMIOS_UCDIS_OU20             (1 << 20) /* Bit 20: Disable UC 20 (UCDIS20) */
#define EMIOS_UCDIS_OU21             (1 << 21) /* Bit 21: Disable UC 21 (UCDIS21) */
#define EMIOS_UCDIS_OU22             (1 << 22) /* Bit 22: Disable UC 22 (UCDIS22) */
#define EMIOS_UCDIS_OU23             (1 << 23) /* Bit 23: Disable UC 23 (UCDIS23) */
                                               /* Bits 24-31: Reserved */

