apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emios.h
/* UC A n (An) */

#define EMIOS_A_SHIFT                (0)       /* Bits 0-15: A */
#define EMIOS_A_MASK                 (0xffff << EMIOS_A_SHIFT)
#define EMIOS_A(n)                   ((n << EMIOS_A_SHIFT) & EMIOS_A_MASK)
                                               /* Bits 16-31: Reserved */

/* UC B n (Bn) */

#define EMIOS_B_SHIFT                (0)       /* Bits 0-15: B */
#define EMIOS_B_MASK                 (0xffff << EMIOS_B_SHIFT)
#define EMIOS_B(n)                   ((n << EMIOS_B_SHIFT) & EMIOS_B_MASK)
                                               /* Bits 16-31: Reserved */

/* UC Counter n (CNTn) */

#define EMIOS_CNT_C_SHIFT            (0)       /* Bits 0-15: Internal Counter Value (C) */
#define EMIOS_CNT_C_MASK             (0xffff << EMIOS_CNT_C_SHIFT)
                                               /* Bits 16-31: Reserved */

/* UC Control n (Cn) */

#define EMIOS_C_MODE_SHIFT                         (0) /* Bits 0-6: Mode Selection (MODE) - NOTE: See S32K3XX Reference Manual for all options! */
#define EMIOS_C_MODE_MASK                          (0x7f << EMIOS_C_MODE_SHIFT)
#  define EMIOS_C_MODE_GPIN                        (0x00 << EMIOS_C_MODE_SHIFT) /* 000_0000: General-Purpose Input mode */
#  define EMIOS_C_MODE_GPOUT                       (0x01 << EMIOS_C_MODE_SHIFT) /* 000_0001: General-Purpose Output mode */
#  define EMIOS_C_MODE_SAIC                        (0x02 << EMIOS_C_MODE_SHIFT) /* 000_0010: Single Action Input Capture mode */
#  define EMIOS_C_MODE_SAIC_EDGE                   (0x42 << EMIOS_C_MODE_SHIFT) /* 100_0010: Single Action Input Capture mode (with edge capturing) */
#  define EMIOS_C_MODE_SAOC                        (0x03 << EMIOS_C_MODE_SHIFT) /* 000_0011: Single Action Output Capture mode */
#  define EMIOS_C_MODE_IPWM                        (0x04 << EMIOS_C_MODE_SHIFT) /* 000_0100: Input Pulse Width Measurement mode */
#  define EMIOS_C_MODE_IPM                         (0x05 << EMIOS_C_MODE_SHIFT) /* 000_0101: Input Period Measurement mode */
#  define EMIOS_C_MODE_DAOC_BMATCH                 (0x06 << EMIOS_C_MODE_SHIFT) /* 000_0110: Double Action Output Compare mode (with FLAG = 1 on B match) */
#  define EMIOS_C_MODE_DAOC_ABMATCH                (0x07 << EMIOS_C_MODE_SHIFT) /* 000_0111: Double Action Output Compare mode (with FLAG = 1 on A and B match) */
#  define EMIOS_C_MODE_PEC_CONT                    (0x0a << EMIOS_C_MODE_SHIFT) /* 000_1010: Pulse Edge Counting mode (continuous) */
#  define EMIOS_C_MODE_PEC_SINGLE                  (0x0b << EMIOS_C_MODE_SHIFT) /* 000_1011: Pulse Edge Counting mode (single-shot) */
#  define EMIOS_C_MODE_MC_UPCNT_CLRSTRT_INTCLK     (0x10 << EMIOS_C_MODE_SHIFT) /* 001_0000: Modulus Counter mode (up counter with clear on match start, internal clock source) */
#  define EMIOS_C_MODE_MC_UPCNT_CLRSTRT_EXTCLK     (0x11 << EMIOS_C_MODE_SHIFT) /* 001_0001: Modulus Counter mode (up counter with clear on match start, external clock source) */
#  define EMIOS_C_MODE_MC_UPCNT_CLREND_INTCLK      (0x12 << EMIOS_C_MODE_SHIFT) /* 001_0010: Modulus Counter mode (up counter with clear on match end, internal clock source) */
#  define EMIOS_C_MODE_MC_UPCNT_CLREND_EXTCLK      (0x13 << EMIOS_C_MODE_SHIFT) /* 001_0011: Modulus Counter mode (up counter with clear on match end, external clock source) */
#  define EMIOS_C_MODE_MC_UPDOWNCNT_CLRSTRT_INTCLK (0x14 << EMIOS_C_MODE_SHIFT) /* 001_0100: Modulus Counter mode (up/down counter with clear on match start, internal clock source) */
#  define EMIOS_C_MODE_MC_UPDOWNCNT_CLRSTRT_EXTCLK (0x15 << EMIOS_C_MODE_SHIFT) /* 001_0101: Modulus Counter mode (up/down counter with clear on match start, external clock source) */
#  define EMIOS_C_MODE_MC_UPDOWNCNT_CLREND_INTCLK  (0x16 << EMIOS_C_MODE_SHIFT) /* 001_0110: Modulus Counter mode (up/down counter with clear on match end, internal clock source) */
#  define EMIOS_C_MODE_MC_UPDOWNCNT_CLREND_EXTCLK  (0x17 << EMIOS_C_MODE_SHIFT) /* 001_0111: Modulus Counter mode (up/down counter with clear on match end, external clock source) */
#  define EMIOS_C_MODE_OPWMT                       (0x26 << EMIOS_C_MODE_SHIFT) /* 010_0110: Output PWM with Trigger mode */
#  define EMIOS_C_MODE_MCB_UPCNT_INTCLK            (0x50 << EMIOS_C_MODE_SHIFT) /* 101_0000: Modulus Counter Buffered mode (up counter, internal clock source) */
#  define EMIOS_C_MODE_MCB_UPCNT_EXTCLK            (0x51 << EMIOS_C_MODE_SHIFT) /* 101_0001: Modulus Counter Buffered mode (up counter, external clock source) */
#  define EMIOS_C_MODE_MCB_UPDOWNCNT_FSTRT_INTCLK  (0x54 << EMIOS_C_MODE_SHIFT) /* 101_0100: Modulus Counter Buffered mode (up/down counter with flag set on match start, internal clock source) */
#  define EMIOS_C_MODE_MCB_UPDOWNCNT_FSTRT_EXTCLK  (0x55 << EMIOS_C_MODE_SHIFT) /* 101_0101: Modulus Counter Buffered mode (up/down counter with flag set on match start, external clock source) */
#  define EMIOS_C_MODE_MCB_UPDOWNCNT_FBND_INTCLK   (0x56 << EMIOS_C_MODE_SHIFT) /* 101_0110: Modulus Counter Buffered mode (up/down counter with flag set on period boundary, internal clock source) */
#  define EMIOS_C_MODE_MCB_UPDOWNCNT_FBND_EXTCLK   (0x57 << EMIOS_C_MODE_SHIFT) /* 101_0111: Modulus Counter Buffered mode (up/down counter with flag set on period boundary, external clock source) */
#  define EMIOS_C_MODE_OPWFMB_BMATCH               (0x58 << EMIOS_C_MODE_SHIFT) /* 101_1000: Output Pulse Width and Frequency Modulation Buffered mode (BS1 match) */
#  define EMIOS_C_MODE_OPWFMB_ABMATCH              (0x5a << EMIOS_C_MODE_SHIFT) /* 101_1010: Output Pulse Width and Frequency Modulation Buffered mode (AS1 or BS1 match) */
#  define EMIOS_C_MODE_OPWMCB_TRAIL_FTRAIL         (0x5c << EMIOS_C_MODE_SHIFT) /* 101_1100: Center Aligned Output PWM with Dead Time Insertion Buffered mode (with trailing edge dead time, input capture flag asserted on trailing edge) */
#  define EMIOS_C_MODE_OPWMCB_TRAIL_FBOTH          (0x5e << EMIOS_C_MODE_SHIFT) /* 101_1110: Center Aligned Output PWM with Dead Time Insertion Buffered mode (with trailing edge dead time, input capture flag asserted on both edges) */
#  define EMIOS_C_MODE_OPWMCB_LEAD_FTRAIL          (0x5d << EMIOS_C_MODE_SHIFT) /* 101_1101: Center Aligned Output PWM with Dead Time Insertion Buffered mode (with leading edge dead time, input capture flag asserted on trailing edge) */
#  define EMIOS_C_MODE_OPWMCB_LEAD_FBOTH           (0x5f << EMIOS_C_MODE_SHIFT) /* 101_1111: Center Aligned Output PWM with Dead Time Insertion Buffered mode (with leading edge dead time, input capture flag asserted on both edges) */
#  define EMIOS_C_MODE_OPWMB_BMATCH                (0x60 << EMIOS_C_MODE_SHIFT) /* 110_0000: Output PWM Buffered mode (BS1 match) */
#  define EMIOS_C_MODE_OPWMB_ABMATCH               (0x62 << EMIOS_C_MODE_SHIFT) /* 110_0010: Output PWM Buffered mode (AS1 or BS1 match) */

#define EMIOS_C_EDPOL                (1 << 7)  /* Bit 7: Edge Polarity (EDPOL) */
#define EMIOS_C_EDSEL                (1 << 8)  /* Bit 8: Edge Selection (EDSEL) */
#define EMIOS_C_BSL_SHIFT            (9)       /* Bits 9-10: Bus Select (BSL) */
#define EMIOS_C_BSL_MASK             (0x03 << EMIOS_C_BSL_SHIFT)
#  define EMIOS_C_BSL_BUSA           (0x00 << EMIOS_C_BSL_SHIFT) /* Counter bus A for all channels */
#  define EMIOS_C_BSL_BUSBCD         (0x01 << EMIOS_C_BSL_SHIFT) /* Counter bus B for channels 0-7, C for 8-15, D for 16-23, E for 24-31 */
#  define EMIOS_C_BSL_BUSF           (0x02 << EMIOS_C_BSL_SHIFT) /* Counter bus F */
#  define EMIOS_C_BSL_INTCNT         (0x03 << EMIOS_C_BSL_SHIFT) /* Internal counter for all channels */

